[
  {
    "type": "career",
    "date": "2024-09-03",
    "title": "Internship at Synopsys - GTA (Not the fun one), Ontario",
    "description": "I wrote firmware for a 224G Ethernet PHY. The firmware was a pain in the ass to test on silicon, so I wrote a framework to help me poke the test chip over a JTAG connection. The framework is now being given to customers. This means that every day, I wake up scared that I left a dirty joke somewhere in the codebase by accident. I consider this fear to be 90% irrational. During this time, I also learned that I really like writing (even if I'm not that good at it yet)."
  },
  {
    "type": "career",
    "date": "2023-05-01",
    "title": "Internship at General Dynamics - Ottawa, Ontario",
    "description": "Joined General Dynamics as a Vetronics Software intern. This was my first experience working on a large codebase as well as my first experience with embedded Linux. At this job I also gained some experience with TypeScript which was a motivating factor behind this website."
  },
  {
    "type": "career",
    "date": "2022-05-04",
    "title": "Internship at Teck Resources Limited - Sparwood, BC",
    "description": "When I wasn't mountain biking I was working on a high-speed transient detection system with Teck's Mining Systems team."
  },
  {
    "type": "career",
    "date": "2021-04-28",
    "title": "Second fire season with BCWS - Fort Nelson, BC",
    "description": "My second wildfire season and the first one where things actually happened. During this time I learned two things: 1. Nothing makes one grateful for the modern office environment quite like being stuck in a smoked-out mosquito infested swamp for sixteen hours (at times multiple days) and 2. Helicopters and chainsaws are really cool."
  },
  {
    "type": "school",
    "date": "2020-09-06",
    "title": "Started University at UBC",
    "description": "First year was remote so I didn't even know what the campus looked like until second year."
  },
  {
    "type": "career",
    "date": "2020-06-28",
    "title": "First fire season with BCWS - Vanderhoof, BC",
    "description": "Thought it would be cool to be a firefighter. Unfortunately the 2020 season in BC was lacking in fires so I mostly just ended up going for a lot of runs and driving around in the bush."
  },
  {
    "type": "school",
    "date": "2020-06-23",
    "title": "Graduation - Vanderhoof, BC",
    "description": "Won a $20 bet that my last name would get mispronounced as I got called up."
  },
  {
    "type": "birthday",
    "date": "2002-08-08",
    "title": "Biological tape-out",
    "description": "Error in /da/club (birfday.jsx:50): party failed to render"
  }
]
